* Introduction

This project is to build a django database for tracking our part
of the IGVF mouse experiment.

mousedemo is the example site
igvf_mice is the app designed to track the wet bench phase of the data collection.

Somehow there will be additional components for tracking
demultiplexing and analysis.

* Debian packages needed
python3-django >= 3.3
python3-djangorestframework
python3-djangorestframework-filters
python3-django-oauth-toolkit
* igvf_mice

** Sina's schema documents

https://dbdiagram.io/d/63797621c9abfc611173e5cd

Sina's conversion of the spreadsheet to his schema
https://docs.google.com/spreadsheets/d/1s89hqaMgav5FKBx3jimZU0WuJOgNLCBISEE21ZFpSqc/edit?usp=sharing

** IGVF DACC metadata sheet

https://docs.google.com/spreadsheets/d/1BLMledzmqOqXnJHzpijgw91IOs-9tSlVeZDG_MtXddk/edit#gid=1493755757

** UCI metadata sheet

UCI started sample tracking before there was time to write a database,
so use the spreadsheet for the initial data load and as a ad-hoc
specification for the data models.

Liz' metadata sheet. IGVF_Split-Seq
https://docs.google.com/spreadsheets/d/13M6-Ry6oXgkx94BHZOGioYPI6F_hWDqjGgcaNu2JNYs/edit#gid=1838362486

* ONT 8 cube splitseq RNA

Convert the spreadsheet into a bit of csv file for test cases

#+name: format_ont_test_data
#+begin_src python  :results output
  import pandas
  from pathlib import Path

  target_samples = ["igvf003_13A-gc_lig-ss_p2_1","igvfB01_13G-gc_lig-ss_11",]

  splitseq_xlsx = "https://woldlab.caltech.edu/nextcloud/index.php/s/eEtjBfDqQFnLpSS/download"
  ont_sheet = pandas.read_excel(splitseq_xlsx, sheet_name="ONT Sequencing", skiprows=1)

  test_data = pandas.concat([ont_sheet.iloc[0:14], ont_sheet.iloc[54:77]])

  print(test_data.to_csv(index=False))
#+end_src

#+RESULTS: format_ont_test_data
#+begin_example
Experiment,Tissue,Sample ID,cDNA Build Date,[cDNA] (ng/uL),Average Length (bp),bp to calculate for loading,Tube ID,Library Build Date,Library Molarity (fmol),cDNA Input (ng),cDNA Volume (uL),H2O Vol. to make up 47uL (uL),[Library] (ng/uL),Loading Molarity (fmol),Loading Input (ng),Total Loading Vol. (uL),Sample Loading Vol. (uL),H2O Vol. to add (uL),Sequencing Date,Kit,ONT Instrument,Flow Cell Type,Flow Cell Chemistry,Flow Cell ID,Position,# of Pores Dectected,Run Length,Raw Reads (M),Estimated Bases (Gb),Estimated N50 (bp),Run Size (GB),MinKNOW Version,Raw Data Type,Convert to raw data? ,# of uncoverted files,# of unconverted reads,final raw data format,# raw reads,raw data file size,raw data checksum (md5sum),Basecaller,Basecaller Version,Bascalling Mode,Basecalling Config,min Q-score (default 10),Passed bases,Passed Reads,fastq.gz file size,checksum (md5sum) .fastq.gz,Trimmed File,Trimmed Reads,checksum (md5sum) .fastq.gz.1,Notes
IGVF003,Main: Cortex + Hippocampus,igvf003_8A_lig-ss_1,HL/ER - 12/02/22,130.0,1150.0,1250.0,ONT001,GF - 12/06/22,200.0,150.0,1.15384615384615,45.8461538461539,2.34,10.0,8.0,12.0,3.41880341880342,8.58119658119658,GF - 12/06/22,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAU11962,X1,1469.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
Founders,Multiplexed: Heart,igvf003_8A_lig-ss_2,HL/ER - 12/02/22,130.0,1150.0,1250.0,ONT001,GF - 12/07/22,200.0,150.0,1.15384615384615,45.8461538461539,2.34,10.0,8.0,12.0,3.41880341880342,8.58119658119658,GF - 12/07/22,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAU06485,X2,1017.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvf003_8A_lig-ss_3,HL/ER - 12/02/22,130.0,1150.0,1250.0,ONT001,GF - 12/07/22,200.0,150.0,1.15384615384615,45.8461538461539,2.34,10.0,8.0,12.0,3.41880341880342,8.58119658119658,GF - 12/07/22,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAU06411,X3,1149.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvf003_8A_lig-ss_4,HL/ER - 12/02/22,130.0,1150.0,1250.0,ONT001,GF - 12/07/22,200.0,150.0,1.15384615384615,45.8461538461539,2.34,10.0,8.0,12.0,3.41880341880342,8.58119658119658,GF - 12/07/22,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAU11624,X4,313.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvf003_8A_lig-ss_5,HL/ER - 12/02/22,130.0,1150.0,1250.0,ONT002,GF - 12/08/22,200.0,150.0,1.15384615384615,45.8461538461539,3.82,10.0,8.0,12.0,2.09424083769634,9.90575916230367,GF - 12/08/22,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAU05901,X1,1472.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvf003_8A_lig-ss_6,HL/ER - 12/02/22,130.0,1150.0,1250.0,ONT002,GF - 12/08/22,200.0,150.0,1.15384615384615,45.8461538461539,3.82,10.0,8.0,12.0,2.09424083769634,9.90575916230367,GF - 12/08/22,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAU06482,X4,1444.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvf003_8A_lig-ss_7,HL/ER - 12/02/22,130.0,1150.0,1250.0,ONT002,GF - 12/08/22,200.0,150.0,1.15384615384615,45.8461538461539,3.82,10.0,8.0,12.0,2.09424083769634,9.90575916230367,GF - 12/08/22,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAU06496,X5,1403.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvf003_8A_lig-ss_8,HL/ER - 12/02/22,130.0,1150.0,1250.0,ONT002,GF - 12/08/22,200.0,150.0,1.15384615384615,45.8461538461539,3.82,10.0,8.0,12.0,2.09424083769634,9.90575916230367,GF - 12/09/22,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAU06476,X2,1423.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvf003_8A_lig-ss_9,HL/ER - 12/02/22,130.0,1150.0,1250.0,ONT002,GF - 12/08/22,200.0,150.0,1.15384615384615,45.8461538461539,3.82,10.0,8.0,12.0,2.09424083769634,9.90575916230367,GF - 12/09/22,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAU11470,X3,1262.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvf003_8A_lig-ss_10,HL/ER - 12/02/22,130.0,1150.0,1250.0,ONT003,JS - 12/13/22,200.0,150.0,1.15384615384615,45.8461538461539,6.1,10.0,8.0,12.0,1.31147540983607,10.6885245901639,JS - 12/13/22,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAV21462,X4,1558.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvf003_8A_lig-ss_11,HL/ER - 12/02/22,130.0,1150.0,1250.0,ONT003,JS - 12/13/22,200.0,150.0,1.15384615384615,45.8461538461539,6.1,10.0,8.0,12.0,1.31147540983607,10.6885245901639,JS - 12/13/22,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAU06484,X5,1399.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvf003_13A-gc_lig-ss_qc_1,GF - 05/18/23,48.2,1144.0,1244.0,ONT018,GF - 05/22/23,200.0,149.0,3.09128630705394,43.9087136929461,2.9,10.0,7.5,12.0,2.58620689655172,9.41379310344828,GF - 06/06/23,SQK-LSK114-XL,MinION,FLO-MIN114,R10.4.1,FAW82381,MIN24672,1080.0,48 hours,15.1,15.19,1130,280.0,23.04.5,fast5,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvf003_13A-gc_lig-ss_p2_1,GF - 05/18/23,48.2,1144.0,1244.0,ONT018,GF - 05/22/23,200.0,149.0,3.09128630705394,43.9087136929461,2.9,20.0,15.0,32.0,5.17241379310345,26.8275862068966,GF - 06/08/23,SQK-LSK114-XL,P2 Solo,FLO-PRO114M,R10.4.1,PAO03808,P2S-00617-B,6809.0,93 hours,92.85,95.44,1180,1540.0,22.07.9,fast5,1.0,2.0,8000.0,pod5,92839059.0,933G,3d76177a266b86aa588e49c4109c08cd,dorado,0.5.0,Super Accurate,dna_r10.4.1_e8.2_400bps_sup@v4.1.0,10.0,,82558734.0,72G,1034404a43366a41b6840ad95b6ac439,,,,
,,igvf003_13A-gc_lig-ss_p2_2,GF - 05/18/23,48.2,1144.0,1244.0,ONT018,GF - 05/22/23,200.0,149.0,3.09128630705394,43.9087136929461,2.9,20.0,15.0,32.0,5.17241379310345,26.8275862068966,GF - 06/13/23,SQK-LSK114-XL,P2 Solo,FLO-PRO114M,R10.4.1,PAO03105,P2S-00617-A,7562.0,,,,,,,fast5,1.0,1.0,4000.0,pod5,74638001.0,780G,3b287a1aa3d119946de71b319c3ad70d,dorado,0.5.0,Super Accurate,dna_r10.4.1_e8.2_400bps_sup@v4.1.0,10.0,,65732603.0,57G,54b785ed64da5b40bef87077858c3819,,,,
,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
IGVFB01,Main: Left Cortex,igvfB01_13G-gc_lig-ss_1,PM 04/04/23,43.2,1473.0,1573.0,ONT012,GF - 04/07/23,200.0,192.0,4.44444444444444,42.5555555555556,3.82,12.0,12.0,12.0,3.1413612565445,8.8586387434555,GF - 04/07/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW43925,X1,1285.0,,,,1020,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
Bridge,,igvfB01_13G-gc_lig-ss_2,PM 04/04/23,43.2,1473.0,1573.0,ONT012,GF - 04/07/23,200.0,192.0,4.44444444444444,42.5555555555556,3.82,12.0,12.0,12.0,3.1413612565445,8.8586387434555,GF - 04/13/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW39250,X1,1398.0,,,,976,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13G-gc_lig-ss_3,PM 04/04/23,43.2,1473.0,1573.0,ONT012,GF - 04/07/23,200.0,192.0,4.44444444444444,42.5555555555556,3.82,12.0,12.0,12.0,3.1413612565445,8.8586387434555,GF - 04/15/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW39152,X1,1360.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13G-gc_lig-ss_4,PM 04/04/23,43.2,1473.0,1573.0,ONT014,GF - 04/17/23,200.0,192.0,4.44444444444444,42.5555555555556,3.06,12.0,12.0,12.0,3.92156862745098,8.07843137254902,GF - 04/17/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW41308,X5,1463.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13G-gc_lig-ss_5,PM 04/04/23,43.2,1473.0,1573.0,ONT014,GF - 04/17/23,200.0,192.0,4.44444444444444,42.5555555555556,3.06,12.0,12.0,12.0,3.92156862745098,8.07843137254902,GF - 04/17/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW43869,X1,1135.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13G-gc_lig-ss_6,PM 04/04/23,43.2,1473.0,1573.0,ONT014,GF - 04/17/23,200.0,192.0,4.44444444444444,42.5555555555556,3.06,12.0,12.0,12.0,3.92156862745098,8.07843137254902,GF - 04/17/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW39263,X3,1128.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13G-gc_lig-ss_7,PM 04/04/23,43.2,1473.0,1573.0,ONT016,GF - 04/19/23,200.0,192.0,4.44444444444444,42.5555555555556,4.48,12.0,12.0,12.0,2.67857142857143,9.32142857142857,GF - 04/19/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW39182,X4,1155.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13G-gc_lig-ss_8,PM 04/04/23,43.2,1473.0,1573.0,ONT016,GF - 04/19/23,200.0,192.0,4.44444444444444,42.5555555555556,4.48,12.0,12.0,12.0,2.67857142857143,9.32142857142857,PM - 04/24/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW43761,X1,,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13G-gc_lig-ss_9,PM 04/04/23,43.2,1473.0,1573.0,ONT016,GF - 04/19/23,200.0,192.0,4.44444444444444,42.5555555555556,4.48,12.0,12.0,12.0,2.67857142857143,9.32142857142857,PM - 04/24/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW39890,X2,,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13G-gc_lig-ss_10,PM 04/04/23,43.2,1473.0,1573.0,ONT016,GF - 04/19/23,200.0,192.0,4.44444444444444,42.5555555555556,4.48,12.0,12.0,12.0,2.67857142857143,9.32142857142857,PM - 04/24/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW43852,X3,,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13G-gc_lig-ss_11,PM 04/04/23,35.5,1091.0,1191.0,ONT021,GF - 05/22/23,200.0,142.0,4.0,43.0,3.38,20.0,14.5,32.0,4.28994082840237,27.7100591715976,GF - 05/19/23,SQK-LSK114,P2 Solo,FLO-PRO114M,R10.4.1,PAO05399,P2S-00617-A,,116 hours,119.09,107.59,,,,fast5,1.0,3.0,12000.0,pod5,119068058.0,1.1 T,7c8c8a63a52f1dacf0e93cac94ac5c0f,dorado,0.5.0,Super Accurate,dna_r10.4.1_e8.2_400bps_sup@v4.1.0,10.0,,105591654.0,78 G,7425dfe4ef2e843d7ea29d648f72a2cd,,,,
,,igvfB01_13H_lig-ss_1,PM 04/04/23,41.3,1447.0,1547.0,ONT013,GF - 04/07/23,200.0,188.0,4.55205811138015,42.4479418886199,4.48,12.0,12.0,12.0,2.67857142857143,9.32142857142857,GF - 04/07/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW41173,X2,1417.0,,,,1070,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13H_lig-ss_2,PM 04/04/23,41.3,1447.0,1547.0,ONT013,GF - 04/07/23,200.0,188.0,4.55205811138015,42.4479418886199,4.48,12.0,12.0,12.0,2.67857142857143,9.32142857142857,GF - 04/13/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW39190,X2,1174.0,,,,1040,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13H_lig-ss_3,PM 04/04/23,41.3,1447.0,1547.0,ONT013,GF - 04/07/23,200.0,188.0,4.55205811138015,42.4479418886199,4.48,12.0,12.0,12.0,2.67857142857143,9.32142857142857,GF - 04/15/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW54715,X2,1340.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13H_lig-ss_4,PM 04/04/23,41.3,1447.0,1547.0,ONT013,GF - 04/07/23,200.0,188.0,4.55205811138015,42.4479418886199,4.48,12.0,12.0,12.0,2.67857142857143,9.32142857142857,GF - 04/15/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW39215,X3,1216.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13H_lig-ss_5,PM 04/04/23,41.3,1447.0,1547.0,ONT015,GF - 04/17/23,200.0,188.0,4.55205811138015,42.4479418886199,4.86,12.0,12.0,12.0,2.46913580246914,9.53086419753086,GF - 04/17/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW39354,X4,1341.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13H_lig-ss_6,PM 04/04/23,41.3,1447.0,1547.0,ONT015,GF - 04/17/23,200.0,188.0,4.55205811138015,42.4479418886199,4.86,12.0,12.0,12.0,2.46913580246914,9.53086419753086,GF - 04/17/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW41239,X5,1308.0,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13H_lig-ss_7,PM 04/04/23,41.3,1447.0,1547.0,ONT015,GF - 04/17/23,200.0,188.0,4.55205811138015,42.4479418886199,4.86,12.0,12.0,12.0,2.46913580246914,9.53086419753086,GF - 04/17/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW43926,MIN24338,,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13H_lig-ss_8,PM 04/04/23,41.3,1447.0,1547.0,ONT015,GF - 04/17/23,200.0,188.0,4.55205811138015,42.4479418886199,4.86,12.0,12.0,12.0,2.46913580246914,9.53086419753086,PM - 04/24/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW39324,X4,,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13H_lig-ss_9,PM 04/04/23,41.3,1447.0,1547.0,ONT015,GF - 04/17/23,200.0,188.0,4.55205811138015,42.4479418886199,4.86,12.0,12.0,12.0,2.46913580246914,9.53086419753086,PM - 04/24/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW39355,X5,,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,igvfB01_13H_lig-ss_10,PM 04/04/23,41.3,1447.0,1547.0,ONT017,GF - 04/19/23,200.0,188.0,4.55205811138015,42.4479418886199,5.8,12.0,12.0,12.0,2.06896551724138,9.93103448275862,PM - 04/24/23,SQK-LSK114,GridION,FLO-MIN114,R10.4.1,FAW39859,MIN24338,,,,,,,,,0.0,,,,,,,Guppy,,Super Accurate,,,,,,,,,,
,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,

#+end_example


| Experiment                | ONT sequencing      | matching |
| Split-seq prep start date | cDNA Build Date     | +1 day?  |
| [cDNA] (ng/nL)            | [cDNA] (ng/nL)      | usually  |
| cDNA Ave. Length (bp)     | Average Length (bp) |          |


There's also another workbook for tracking methylation experiments.

https://docs.google.com/spreadsheets/d/1v-9B2VnQN58u_87q-Zi1Nl8Gy23CFxOS3FL_yqMB9JA/edit#gid=1833054806

